docs: apply mermaid
